package com.example.chirag.librarybooklocator;

/**
 * Created by effy on 2018/4/23.
 */


/**
 * Created by jo on 2018/4/18.
 */

public class MapData {
    //颜色：
    //背景：176,210,212
    //地图边框：113,170,174
    //由浅到深：
    //255,255,255
    //214,228,237
    //159,199,201
    //12,53,85
    //右边的：
    //122,187,191
    //黄色：250,171,33
    //红色：221,70,56
    // Define points for equilateral triangles.

    // This triangle is red, green, and blue.

    // This triangle is yellow, cyan, and magenta.
    final float[] border = {
            // X, Y, Z,
            // R, G, B, A
            //地图边框：113,170,174
            -0.5f, 0.5f, 0.0f,
            113 / 255f, 170 / 255f, 174 / 255f, 1.0f,

            -0.5f, -0.5f, 0.0f,
            113 / 255f, 170 / 255f, 174 / 255f, 1.0f,

            0.5f, -0.5f, 0.0f,
            113 / 255f, 170 / 255f, 174 / 255f, 1.0f,

            0.5f, 0.5f, 0.0f,
            113 / 255f, 170 / 255f, 174 / 255f, 1.0f,
    };
    final float[] border2 = {
            // X, Y, Z,
            // R, G, B, A
            //地图边框：113,170,174
            -0.5f, 0.5f, 0.0f,
            65 / 255f, 95 / 255f, 121 / 255f, 1.0f,

            -0.5f, -0.5f, 0.0f,
            65 / 255f, 95 / 255f, 121 / 255f, 1.0f,

            0.5f, -0.5f, 0.0f,
            65 / 255f, 95 / 255f, 121 / 255f, 1.0f,

            0.5f, 0.5f, 0.0f,
            65 / 255f, 95 / 255f, 121 / 255f, 1.0f,
    };
    final float[] triangle1VerticesData = {
            // X, Y, Z,
            // R, G, B, A
            //第一深蓝色矩形
            -0.5f, 0.5f, 0.0f,
            12 / 255f, 53 / 255f, 85 / 255f, 1.0f,

            -0.5f, -0.5f, 0.0f,
            12 / 255f, 53 / 255f, 85 / 255f, 1.0f,

            0.5f, -0.5f, 0.0f,
            12 / 255f, 53 / 255f, 85 / 255f, 1.0f,

            0.5f, 0.5f, 0.0f,
            12 / 255f, 53 / 255f, 85 / 255f, 1.0f
    };

    final float[] triangle2VerticesData = {

            // X, Y, Z,
            // R, G, B, A
            //第二深蓝色矩形
            -0.5f, 0.5f, 0.0f,
            159 / 255f, 199 / 255f, 201 / 255f, 1.0f,

            -0.5f, -0.5f, 0.0f,
            159 / 255f, 199 / 255f, 201 / 255f, 1.0f,

            0.5f, -0.5f, 0.0f,
            159 / 255f, 199 / 255f, 201 / 255f, 1.0f,

            0.5f, 0.5f, 0.0f,
            159 / 255f, 199 / 255f, 201 / 255f, 1.0f,
    };


    // This triangle is white, gray, and black.
    final float[] triangle3VerticesData = {
            // X, Y, Z,
            // R, G, B, A
            //第二浅蓝色矩形
            -0.5f, 0.5f, 0.0f,
            214 / 255f, 228 / 255f, 237 / 255f, 1.0f,

            -0.5f, -0.5f, 0.0f,
            214 / 255f, 228 / 255f, 237 / 255f, 1.0f,

            0.5f, -0.5f, 0.0f,
            214 / 255f, 228 / 255f, 237 / 255f, 1.0f,

            0.5f, 0.5f, 0.0f,
            214 / 255f, 228 / 255f, 237 / 255f, 1.0f
    };
    final float[] triangle4VerticesData = {
            // X, Y, Z,
            // R, G, B, A
            //第一浅蓝色矩形(白色)
            -0.5f, 0.5f, 0.0f,
            1f, 1f, 1f, 1.0f,

            -0.5f, -0.5f, 0.0f,
            1f, 1f, 1f, 1.0f,

            0.5f, -0.5f, 0.0f,
            1f, 1f, 1f, 1.0f,

            0.5f, 0.5f, 0.0f,
            1f, 1f, 1f, 1.0f,
    };
    final float[] yellow = {
            // X, Y, Z,
            // R, G, B, A
            //黄色 //黄色：250,171,33
            -0.5f, 0.5f, 0.0f,
            250 / 255f, 171 / 255f, 33 / 255f, 1.0f,

            -0.5f, -0.5f, 0.0f,
            250 / 255f, 171 / 255f, 33 / 255f, 1.0f,

            0.5f, -0.5f, 0.0f,
            250 / 255f, 171 / 255f, 33 / 255f, 1.0f,

            0.5f, 0.5f, 0.0f,
            250 / 255f, 171 / 255f, 33 / 255f, 1.0f,
    };
    final float[] red = {
            // X, Y, Z,
            // R, G, B, A
            //红色：221,70,56
            -0.5f, 0.5f, 0.0f,
            221 / 255f, 70 / 255f, 56 / 255f, 1.0f,

            -0.5f, -0.5f, 0.0f,
            221 / 255f, 70 / 255f, 56 / 255f, 1.0f,

            0.5f, -0.5f, 0.0f,
            221 / 255f, 70 / 255f, 56 / 255f, 1.0f,

            0.5f, 0.5f, 0.0f,
            221 / 255f, 70 / 255f, 56 / 255f, 1.0f,
    };
}
